# DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
#With numpy
df = pd.DataFrame(np.random.randn(5,4),index=["A","B","C","D","E"],columns=["W","X","Y","Z"])
df

          W         X         Y         Z
A  2.398278  0.161332  0.372214  0.064983
B -1.259924  2.073776 -0.003237  0.081306
C  0.440780  1.483932 -0.153188  1.407616
D -0.340072 -2.345363  0.066694  1.445207
E  0.061044 -0.841957  0.919774  0.359936

In [3]:
#With Lists
x1=["John",24,"New Delhi","India"]
x2=["Jerry",32,"New York","USA"]
x3=["Tom",34,"Manhattan","USA"]
x4=["Jack",45,"Chicago","USA"]
New=pd.DataFrame([x1,x2,x3,x4],columns=["Name","Age","City","Country"],index=[11,12,13,14])
New

     Name  Age       City Country
11   John   24  New Delhi   India
12  Jerry   32   New York     USA
13    Tom   34  Manhattan     USA
14   Jack   45    Chicago     USA

In [4]:
#With Tuples
x1=("John",24,"New Delhi","India")
x2=("Jerry",32,"New York","USA")
x3=("Tom",34,"Manhattan","USA")
x4=("Jack",45,"Chicago","USA")
New1=pd.DataFrame([x1,x2,x3,x4],columns=["Name","Age","City","Country"],index=["A","B","C","D"])
New1

    Name  Age       City Country
A   John   24  New Delhi   India
B  Jerry   32   New York     USA
C    Tom   34  Manhattan     USA
D   Jack   45    Chicago     USA

In [5]:
#With Dictionaries
datas={"Name":["Karan","Raman","Shravan","Ajay","Vijay","Sanjay"],"Age":[23,24,25,26,25,21],"Location":["Banglore","Chandigarh","Chennai","Mumbai","Kolkata","Pune"],"Salary":[22900,25800,24000,23000,25000,25500]}
datas
datas=pd.DataFrame(datas)
datas

#With numpy
df = pd.DataFrame(np.random.randn(5,4),index=["A","B","C","D","E"],columns=["W","X", "Y","Z"])
df

          W         X         Y         Z
A  0.266104  0.216709 -0.339083 -0.582613
B  0.736200 -1.520868 -0.620117  0.940499
C -0.932198  0.809969  0.758837  1.813743
D  0.110742  0.069698 -0.484837 -0.324821
E -0.632529 -0.847141  0.230369  0.184365

In [6]:
np.arange(18).reshape(3,6)
df

          W         X         Y         Z
A  0.266104  0.216709 -0.339083 -0.582613
B  0.736200 -1.520868 -0.620117  0.940499
C -0.932198  0.809969  0.758837  1.813743
D  0.110742  0.069698 -0.484837 -0.324821
E -0.632529 -0.847141  0.230369  0.184365

In [7]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [8]:
import numpy as np
import pandas as pd

x=np.arange(0,20)
fd=x.reshape(5,4)
fd
fd=pd.DataFrame(fd,index=["A","B","C","D","E"],columns=["W","X","Y","Z"])
fd

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [9]:
x

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

In [12]:
fd
datas

      Name  Age    Location  Salary
0    Karan   23    Banglore   22900
1    Raman   24  Chandigarh   25800
2  Shravan   25     Chennai   24000
3     Ajay   26      Mumbai   23000
4    Vijay   25     Kolkata   25000
5   Sanjay   21        Pune   25500

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [24]:
datas[["Salary","Name","Age"]]

   Salary     Name  Age
0   22900    Karan   23
1   25800    Raman   24
2   24000  Shravan   25
3   23000     Ajay   26
4   25000    Vijay   25
5   25500   Sanjay   21

In [14]:
print(datas.shape)
print(df.shape)

print(datas.columns)

(6, 4)
(5, 4)
Index(['Name', 'Age', 'Location', 'Salary'], dtype='object')

In [26]:
datas.shape #Will give you no. of rows and no. of columns
datas.columns # Will give you the column names.

Index(['Name', 'Age', 'Location', 'Salary'], dtype='object')

In [27]:
# Pass a list of column names
fd[["Z","Y","X","W"]]
#datas[["Salary","Age","Name","Location"]]
fd

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [28]:
fd

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [29]:
#Renaming Columns
#fd.rename(columns={"W":"shape"},inplace=True)
fd.rename(index={"B":"BAG"})
fd.rename({"X":"Happy"},axis=1)#Columns
fd.rename({"D":"Delhi"},axis=0)#Row


#fd.rename(columns={"shape":"W","Happy":"X"},index={"BAG":"B","Delhi":"D"},inplace=True)
#fd

        W   X   Y   Z
A       0   1   2   3
B       4   5   6   7
C       8   9  10  11
Delhi  12  13  14  15
E      16  17  18  19

In [33]:
fd

    W   X   Y   Z  New     City
A   0   1   2   3    4    Delhi
B   4   5   6   7   12   Mumbai
C   8   9  10  11   20  Chennai
D  12  13  14  15   28  Kolkata
E  16  17  18  19   36      Goa

** Removing Columns**

In [ ]:
#Dropping the Column
df.drop(["W","Y"],axis=1)#axis-1 means column wise
df.drop(["A","E","C"],axis=0)#axis=0 means row wise

In [ ]:
# Not inplace unless specified!
fd.drop(index=["A","B"],columns=["W","X"])

In [ ]:
df.drop('Z',axis=1)

In [ ]:
fd

Can also drop rows this way:

In [ ]:
#df.drop('E',axis=0)

In [ ]:
fd=np.arange(0,20).reshape(5,4)
fd=pd.DataFrame(fd,columns=["W","X","Y","Z"],index=["A","B","C","D","E"])
fd["New"]=fd["Y"]*fd["Z"]
#fd["New2"]=["Hi","Hello","Good","Star","Plus"]
#fd.drop(columns="New2",inplace=True)
fd

# Loc and iLoc

** Selecting Rows**

In [35]:
fd

#LOC executes on the column's name
#iloc executies on the column's index position number

    W   X   Y   Z  New     City
A   0   1   2   3    4    Delhi
B   4   5   6   7   12   Mumbai
C   8   9  10  11   20  Chennai
D  12  13  14  15   28  Kolkata
E  16  17  18  19   36      Goa

In [36]:
import pandas as pd
import numpy as np

In [38]:
car=pd.read_csv("Car_sales.csv")
car
#\\
#/

,Manufacturer,Model,Sales in thousands,x_4_year,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch,Unnamed: 15,XX
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2-Feb-14,NaN,16.360
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6-Mar-15,NaN,19.875
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1-Apr-14,NaN,18.225
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3-Oct-15,NaN,29.725
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10-Aug-15,NaN,22.255
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,Volvo,V40,3.545,NaN,Passenger,24.40,1.9,160.0,100.5,67.6,176.6,3.042,15.8,25.0,21-Sep-15,NaN,NaN
153,Volvo,S70,15.245,NaN,Passenger,27.50,2.4,168.0,104.9,69.3,185.9,3.208,17.9,25.0,24-Nov-14,NaN,NaN
154,Volvo,V70,17.531,NaN,Passenger,28.80,2.4,168.0,104.9,69.3,186.2,3.259,17.9,25.0,25-Jun-15,NaN,NaN
155,Volvo,C70,3.493,NaN,Passenger,45.50,2.3,236.0,104.9,71.5,185.7,3.601,18.5,23.0,26-Apr-15,NaN,NaN
156,Volvo,S80,18.969,NaN,Passenger,36.00,2.9,201.0,109.9,72.1,189.8,3.600,21.1,24.0,14-Nov-15,NaN,NaN

In [39]:
#loc and iloc
car.iloc[:,:15]
car.columns
car.loc[:,['Model', 'Sales in thousands', 'x_4_year',
       'Vehicle type', 'Price in thousands', 'Engine size', 'Horsepower',
       'Wheelbase', 'Width', 'Length', 'Curb weight', 'Fuel capacity',
       'Fuel efficiency', 'Latest Launch','Manufacturer']]

,Model,Sales in thousands,x_4_year,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch,Manufacturer
0,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2-Feb-14,Acura
1,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6-Mar-15,Acura
2,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1-Apr-14,Acura
3,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3-Oct-15,Acura
4,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10-Aug-15,Audi
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,V40,3.545,NaN,Passenger,24.40,1.9,160.0,100.5,67.6,176.6,3.042,15.8,25.0,21-Sep-15,Volvo
153,S70,15.245,NaN,Passenger,27.50,2.4,168.0,104.9,69.3,185.9,3.208,17.9,25.0,24-Nov-14,Volvo
154,V70,17.531,NaN,Passenger,28.80,2.4,168.0,104.9,69.3,186.2,3.259,17.9,25.0,25-Jun-15,Volvo
155,C70,3.493,NaN,Passenger,45.50,2.3,236.0,104.9,71.5,185.7,3.601,18.5,23.0,26-Apr-15,Volvo
156,S80,18.969,NaN,Passenger,36.00,2.9,201.0,109.9,72.1,189.8,3.600,21.1,24.0,14-Nov-15,Volvo

In [40]:
car

,Manufacturer,Model,Sales in thousands,x_4_year,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch,Unnamed: 15,XX
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2-Feb-14,NaN,16.360
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6-Mar-15,NaN,19.875
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1-Apr-14,NaN,18.225
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3-Oct-15,NaN,29.725
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10-Aug-15,NaN,22.255
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,Volvo,V40,3.545,NaN,Passenger,24.40,1.9,160.0,100.5,67.6,176.6,3.042,15.8,25.0,21-Sep-15,NaN,NaN
153,Volvo,S70,15.245,NaN,Passenger,27.50,2.4,168.0,104.9,69.3,185.9,3.208,17.9,25.0,24-Nov-14,NaN,NaN
154,Volvo,V70,17.531,NaN,Passenger,28.80,2.4,168.0,104.9,69.3,186.2,3.259,17.9,25.0,25-Jun-15,NaN,NaN
155,Volvo,C70,3.493,NaN,Passenger,45.50,2.3,236.0,104.9,71.5,185.7,3.601,18.5,23.0,26-Apr-15,NaN,NaN
156,Volvo,S80,18.969,NaN,Passenger,36.00,2.9,201.0,109.9,72.1,189.8,3.600,21.1,24.0,14-Nov-15,NaN,NaN

In [ ]:
car.head(25)

In [41]:
car
#Dropping the columns
#car.drop(columns=['Unnamed: 15', 'XX'])
car.drop(['Unnamed: 15', 'XX'],axis=0)
car
#car.shape
#car=car.iloc[:,:15]
#car=car.loc[:,['Manufacturer', 'Model', 'Sales in thousands', 'x_4_year','Vehicle type', 'Price in thousands', 'Engine size', 'Horsepower','Wheelbase', 'Width', 'Length', 'Curb weight', 'Fuel capacity','Fuel efficiency', 'Latest Launch']]
#car

KeyError: "['Unnamed: 15', 'XX'] not found in axis"

In [42]:

#fd.loc[:,3]
#fd.iloc[:,3]
fd

    W   X   Y   Z  New     City
A   0   1   2   3    4    Delhi
B   4   5   6   7   12   Mumbai
C   8   9  10  11   20  Chennai
D  12  13  14  15   28  Kolkata
E  16  17  18  19   36      Goa

In [43]:
fd
#loc
fd.loc[:,"W"]
fd.loc[:,["X","Z","Y"]]
fd.loc[["A"],:]
fd.loc[["A","C","E"],:]
fd.loc[["A","C","E"],["X","Z","W"]]
#iloc
fd.iloc[:,0]
fd.iloc[:,[1,3,2]]
fd.iloc[0,:]
fd.iloc[[0,2,4],:]
fd.iloc[[0,2,4],[1,3,0]]
fd

    W   X   Y   Z  New     City
A   0   1   2   3    4    Delhi
B   4   5   6   7   12   Mumbai
C   8   9  10  11   20  Chennai
D  12  13  14  15   28  Kolkata
E  16  17  18  19   36      Goa

In [ ]:
car.head()

In [52]:
car.iloc[[2],:6]

,Manufacturer,Model,Sales in thousands,x_4_year,Vehicle type,Price in thousands
2,Acura,CL,14.114,18.225,Passenger,NaN

In [50]:
car.iloc[[4,5,6,7,8,10,20],:7]

,Manufacturer,Model,Sales in thousands,x_4_year,Vehicle type,Price in thousands,Engine size
4,Audi,A4,20.397,22.255,Passenger,23.990,1.8
5,Audi,A6,18.780,23.555,Passenger,33.950,2.8
6,Audi,A8,1.380,39.000,Passenger,62.000,4.2
7,NaN,323i,19.747,NaN,Passenger,26.990,2.5
8,NaN,328i,9.231,28.675,Passenger,33.400,2.8
10,Buick,Century,91.561,12.475,Passenger,21.975,3.1
20,Chevrolet,Malibu,135.126,11.225,Passenger,16.535,3.1

In [48]:
car.loc[[4,5,6,7,8,10,20,30,50],["Manufacturer","Sales in thousands","Engine size"]]

     Manufacturer  Sales in thousands  Engine size
4   Audi                       20.397          1.8
5   Audi                       18.780          2.8
6   Audi                        1.380          4.2
7             NaN              19.747          2.5
8             NaN               9.231          2.8
10  Buick                      91.561          3.1
20  Chevrolet                 135.126          3.1
30  Chrysler                   31.148          2.7
50  Ford                      175.670          2.0

In [ ]:
#      7,0,16,13,19
fd.loc["B","Z"]
fd.iloc[1,3]
fd.loc["E","W"]
fd.iloc[4,0]

In [ ]:
#7
fd.iloc[1,3]
fd.loc["B","Z"]
#0
fd.iloc[0,0]
fd.loc["A","W"]
#16
fd.iloc[4,0]
fd.loc["E","W"]
#35
fd.iloc[1,5]
fd.loc["B","New2"]
#9
fd.iloc[2,1]
fd.loc["C","X"]
#323
fd.iloc[4,5]
fd.loc["E","New2"]

Or select based off of position instead of label

In [ ]:
print(fd)
fd.iloc[2,2]
#fd.loc["C","W"]

In [ ]:
fd.loc[['A','B',"E"],['W','Y',"Z"]]
#fd.iloc[0,1]
#fd

In [ ]:
#To get the data for a single ROW or COLUMN, can include [].
car.iloc[[2],:5]#For a single ROW
car.iloc[:10,[2]]#For a single COLUMN

#Exercise try to execute the same code with loc.

In [ ]:
fd.loc[:,"W":"Y"]
#fd.iloc[:,:3]

In [ ]:
fd.iloc[[0,2,1],:]

In [ ]:
fd.iloc[[0,2,4],[1,2,0]]
fd.loc[["A","C","E"],["X","Y"]]
fd

In [ ]:
fd.iloc[0:2,:]#Row= 0 through 2, all columns
fd.iloc[0:-2, :]

In [ ]:
fd.loc["A":"C",:]#Row = A through C, all Columns

In [ ]:
fd.loc[:,"X"]#All Rows and X Columns

## Working on UFO Data with loc and iloc

In [ ]:
import pandas as pd
import numpy as np
ufo=pd.read_csv("C:/Users/admin/Desktop/Data/Ufo.csv")
ufo.shape
ufo.columns
ufo.head(15)
#ufo.tail(15)

In [ ]:
ufo=ufo.iloc[:,1:]
ufo

In [ ]:
ufo["City"].value_counts()
ufo[ufo["City"]=="Ithaca"]
ufo[ufo["City"]=="Holyoke"]
ufo[ufo["Shape Reported"]=="CIRCLE"]
ufo["Colors Reported"].value_counts().nlargest(10)
#ufo["Colors Reported"].value_counts().nsmallest()

In [ ]:
ufo["City"].value_counts()
#ufo["City"].value_counts().nlargest(15)

#nlargest and nsmallest
#With Series as the type, head() and tail() will both execute!!

#Task1
Execute the value_counts() on Colors Reported, Shape Reported and State colum and get the names of most occuring
15 observations from 3 columns

In [ ]:
ufo["City"].value_counts().head()
ufo.loc[ufo["City"]=="Los Angeles",:]

In [ ]:
ufo[ufo["City"]=="Phoenix"]
ufo[ufo["City"]=="Las Vegas"]

In [ ]:
ufo[ufo["City"]=="Seattle"][["City","Colors Reported","Shape Reported"]]
#ufo[ufo["City"]=="Lextington"]

In [ ]:
ufo[ufo["City"]=="Seattle"]
ufo[ufo["State"]=="MI"]
ufo[ufo["Shape Reported"]=="TRIANGLE"]
ufo[ufo["State"]=="TX"]
ufo[ufo["Colors Reported"]=="RED"]

In [ ]:
ufo.head()
car.head(20)

ufo.tail(10)
car.tail()
#Try to execute value_counts() on below city names
#Seattle, San Diego, Miami, Albuquerque, Springfield, Tucson, Colorado Springs, Jacksonville

In [ ]:
ufo.loc[ufo["City"]=="San Diego",:]
ufo.loc[(ufo["City"]=="Los Angeles") | (ufo["City"]=="San Diego") | (ufo["City"]=="Holyoke"),:]

In [ ]:
ufo.loc[ufo["City"]=="Ithaca",["City","State","Shape Reported"]]

In [ ]:
ufo.loc[ufo["City"]=="Holyoke",["City","State","Time"]]

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
#print(df)
fd

In [ ]:
fd[fd<=10]

In [ ]:
#df[df>0]
fd[fd>=2]

In [ ]:
ufo[ufo["Shape Reported"]=="DISK"].head()
#ufo[ufo["Shape Reported"]=="DISK"]
fd

In [ ]:

fd[fd["W"]>0]
#fd[fd["W"]>10]
#fd[fd["Z"]>10]

In [ ]:
X

In [ ]:
print(fd)
fd[fd["W"]>4]
fd[fd["Z"]<11]
fd[fd["X"]>5]#Column
fd[fd["W"]>8]

In [ ]:
print(fd)
fd[fd["Z"]>=11]
fd[fd["W"]==8]

In [ ]:
fd[fd["Z"]>0]

In [ ]:
#df[df["Y"]>0]
#ufo=ufo.iloc[:,1:]
ufo.head()
#New York City and RED Colors  and TRIANGLE Shape
ufo[(ufo["City"]=="New York City") & (ufo["Colors Reported"]=="RED") & (ufo["Shape Reported"]=="TRIANGLE")]

In [ ]:
#City name is Seattle, Shape is OVAL and Color is Red
ufo[(ufo["City"]=="Seattle") & (ufo["Shape Reported"]=="OVAL") & (ufo["Colors Reported"]=="Red")]

In [ ]:
ufo[ufo["City"]=="Las Vegas"][["Shape Reported","Colors Reported"]]
ufo[(ufo["City"]=="Las Vegas") & (ufo["Shape Reported"]=="LIGHT") & (ufo["Colors Reported"]=="BLUE")]

ufo[(ufo["City"]=="Houston") & (ufo["Shape Reported"]=="DIAMOND")]

In [ ]:
ufo.head()
ufo[(ufo["City"]=="Seattle") & (ufo["Shape Reported"]=="TRIANGLE") & (ufo["Colors Reported"]=="ORANGE")]

#ufo[(condition1) & (condition2)]

In [ ]:
x=ufo[ufo["City"]=="Seattle"]
y=x[x["Shape Reported"]=="TRIANGLE"]
y[y["Colors Reported"]=="ORANGE"]

In [ ]:
ufo[ufo["City"]=="New York City"]["Colors Reported"].value_counts()
#ufo["City"].value_counts()

#Select New York City which has RED color.
ufo[(ufo["City"]=="New York City") & (ufo["Colors Reported"]=="RED") & (ufo["Shape Reported"]=="TRIANGLE")]

#Exercise
#City name: Houston, Colors Reported: Green, Shape Reported: SPHERE, doesn't need state and time column.

In [ ]:
ufo.loc[(ufo['City']=='Houston')&(ufo['Colors Reported']=='Red')&(ufo['Shape Reported']=='FIREBALL'),["City","Colors Reported","Shape Reported"]]

For two conditions you can use | and & with parenthesis:

In [ ]:
#ufo[(ufo["City"]=="Ithaca") & (ufo["Colors Reported"]=="Red") & (ufo["Shape Reported"]=="OTHER") & (ufo["State"]=="NY")]
ufo[(ufo["City"]=="Seattle") & (ufo["Shape Reported"]=="CIRCLE") & (ufo["Colors Reported"]=="GREEN")]

In [ ]:
#ufo[(ufo["City"]=="Los Angeles") & (ufo["Shape Reported"]=="DISK")]
ufo.loc[(ufo["City"]=="Los Angeles") & (ufo["Shape Reported"]=="DISK"),:]

In [ ]:
ufo[(ufo["City"]=="New York City") & (ufo["Shape Reported"]=="TEARDROP")]
ufo

In [ ]:
#Can you print the first 5 observations with Colum name as 1,2,3,4,5 with only the below command
a=pd.DataFrame(ufo.tail(10).values,columns=ufo.columns)
a
#ufo.tail(10).values


## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
#x=fd.copy()
#z=x.reset_index().drop("index",axis=1)
#z
fd.reset_index().drop(columns="index")
#fd

In [ ]:
fd.iloc[[0,2,4],[0,2]].reset_index().drop("index",axis=1)

In [ ]:
# Can restore the index names with rename function
z.rename({0:"A",1:"B",2:"C",3:"D",4:"E"},inplace=True)

In [ ]:
#z
ufo.head()
ufo=ufo.rename(columns={"City":"City_Name"})
ufo

In [ ]:
ufo.head()

In [ ]:
#x=x.reset_index().drop(columns="index")
#x=x.iloc[[0,1,2,4],:]
#x=x.reset_index().drop(columns="index")
x

In [ ]:
fd=fd.iloc[:,1:]
fd

In [ ]:
# Reset to default 0,1...n index
#df.reset_index()
fd.reset_index()

In [ ]:
newind = 'CA NY WY OR CO'.split()
newind

In [ ]:
fd['States'] = newind

In [ ]:
fd

In [ ]:
fd=fd.set_index('States')
fd
#fd.loc[["CA","WY","OR"],:]

In [ ]:
fd

In [ ]:
ufo.head()

# Changing the Columns

In [ ]:
ufo.rename(columns={"City":"CITY_CITY"})
#ufo.rename(columns={"Shape Reported":"SR"},inplace=True)
ufo

# Discovering and Deleting Duplicate Values

subset: Subset takes a column or list of column label. Itâ€™s default value is none. After passing columns, it will consider them only for duplicates.
keep: keep is to control how to consider duplicate value. It has only three distinct value and default is â€˜firstâ€™.

 * If â€˜firstâ€™, it considers first value as unique and rest of the same values as duplicate.
 * If â€˜lastâ€™, it considers last value as unique and rest of the same values as duplicate.
 * If False, it consider all of the same values as duplicates

In [ ]:
#Dropping/Deleting the duplicate values
data=pd.read_csv("C:/Users/admin/Desktop/Data/employees.csv")

print(data.shape)
data.head()
data.shape
data
ufo

In [ ]:
data[data.duplicated(subset="First Name")==True]
#ufo[ufo.duplicated(subset=["City","Colors Reported"])==True]

In [ ]:
#print(ufo.shape)
#data.drop_duplicates(subset=["First Name","Team"],keep=False)
data.drop_duplicates(subset="First Name",keep=False)
#ufo.drop_duplicates(subset="City",keep=False).shape

In [ ]:
d1={"Name":["Karan","Karan1","Karan2","Karan3","Karan4","Karan5","Karan6"],"Age":[24,24,25,26,24,25,27]}
temp=pd.DataFrame(d1)
temp

In [ ]:
temp.drop_duplicates(subset="Age",keep=False)

In [ ]:
#ufo
import pandas as pd

# Displaying Compressed Data

In [ ]:
pd.set_option("display.max_columns",None)
pd.set_option("display.max_rows",None)

In [ ]:
ufo

In [ ]:
#ufo[ufo["City"]=="Seattle"]

#ufo.loc[ufo["City"]=="Seattle",:]


ufo.iloc[[0,1,2,3,4,5,6,67,34,78,12,999,15000],].drop("Unnamed: 0",axis=1)

temp=ufo.iloc[[0,1,2,3,4,5,6,67,34,78,12,999,15000],]

In [ ]:
#temp.drop("Unnamed: 0",axis=1,inplace=True)
#temp

ufo.iloc[100:1000:6,::2]

In [ ]:
#Exercise
#Find the name of the Manufacturers who are manufacturing only the Cars(Vehicle_type)
#Find the name of the Manufacturer who are manufacturing only the Passenger_Vehicle, also find top3 Manufacturers who-
# are generating most Sales.

In [ ]:
#car[car["Vehicle type"]=="Passenger"][["Manufacturer","Vehicle type"]]
car[["Manufacturer","Model","Sales in thousands"]].nlargest(5,"Sales in thousands")
car[["Manufacturer","Model","Sales in thousands"]].sort_values("Sales in thousands",ascending=False).head()

    Manufacturer              Model  Sales in thousands
56          Ford  F-Series                      540.561
52          Ford  Explorer                      276.747
137       Toyota  Camry                         247.994
49          Ford  Taurus                        245.815
58         Honda  Accord                        230.902

In [ ]:
car[car["Manufacturer"]=='Volvo        ']
car["Manufacturer"]=car["Manufacturer"].str.strip()

In [ ]:
car["Manufacturer"].values
#car[car["Manufacturer"]=="Dodge"]
car["Model"].values

array(['Integra          ', 'TL               ', 'CL               ',
       'RL               ', 'A4               ', 'A6               ',
       'A8               ', '323i             ', '328i             ',
       '528i             ', 'Century          ', 'Regal            ',
       'Park Avenue      ', 'LeSabre          ', 'DeVille          ',
       'Seville          ', 'Eldorado         ', 'Catera           ',
       'Escalade         ', 'Cavalier         ', 'Malibu           ',
       'Lumina           ', 'Monte Carlo      ', 'Camaro           ',
       'Corvette         ', 'Prizm            ', 'Metro            ',
       'Impala           ', 'Sebring Coupe    ', 'Sebring Conv.    ',
       'Concorde         ', 'Cirrus           ', 'LHS              ',
       'Town & Country   ', '300M             ', 'Neon             ',
       'Avenger          ', 'Stratus          ', 'Intrepid         ',
       'Viper            ', 'Ram Pickup       ', 'Ram Wagon        ',
       'Ram Van          ', 'Dakota           ', 'Durango          ',
       'Caravan          ', 'Escort           ', 'Mustang          ',
       'Contour          ', 'Taurus           ', 'Focus            ',
       'Crown Victoria   ', 'Explorer         ', 'Windstar         ',
       'Expedition       ', 'Ranger           ', 'F-Series         ',
       'Civic            ', 'Accord           ', 'CR-V             ',
       'Passport         ', 'Odyssey          ', 'Accent           ',
       'Elantra          ', 'Sonata           ', 'I30              ',
       'S-Type           ', 'Wrangler         ', 'Cherokee         ',
       'Grand Cherokee   ', 'ES300            ', 'GS300            ',
       'GS400            ', 'LS400            ', 'LX470            ',
       'RX300            ', 'Continental      ', 'Town car         ',
       'Navigator        ', 'Mirage           ', 'Eclipse          ',
       'Galant           ', 'Diamante         ', '3000GT           ',
       'Montero          ', 'Montero Sport    ', 'Mystique         ',
       'Cougar           ', 'Sable            ', 'Grand Marquis    ',
       'Mountaineer      ', 'Villager         ', 'C-Class          ',
       'E-Class          ', 'S-Class          ', 'SL-Class         ',
       'SLK              ', 'SLK230           ', 'CLK Coupe        ',
       'CL500            ', 'M-Class          ', 'Sentra           ',
       'Altima           ', 'Maxima           ', 'Quest            ',
       'Pathfinder       ', 'Xterra           ', 'Frontier         ',
       'Cutlass          ', 'Intrigue         ', 'Alero            ',
       'Aurora           ', 'Bravada          ', 'Silhouette       ',
       'Neon             ', 'Breeze           ', 'Voyager          ',
       'Prowler          ', 'Sunfire          ', 'Grand Am         ',
       'Firebird         ', 'Grand Prix       ', 'Bonneville       ',
       'Montana          ', 'Boxter           ', 'Carrera Coupe    ',
       'Carrera Cabriolet', '5-Sep', '3-Sep', 'SL               ',
       'SC               ', 'SW               ', 'LW               ',
       'LS               ', 'Outback          ', 'Forester         ',
       'Corolla          ', 'Camry            ', 'Avalon           ',
       'Celica           ', 'Tacoma           ', 'Sienna           ',
       'RAV4             ', '4Runner          ', 'Land Cruiser     ',
       'Golf             ', 'Jetta            ', 'Passat           ',
       'Cabrio           ', 'GTI              ', 'Beetle           ',
       'S40              ', 'V40              ', 'S70              ',
       'V70              ', 'C70              ', 'S80              '],
      dtype=object)

In [ ]:
#nlargest()
#nsmallest()

In [ ]:
#ufo.head()
#Seattle, San Diego, Miami, Albuquerque, Springfield, Tucson, Colorado Springs, Jacksonville

# Great Job!